---
title: AnalyticalModelFailures
classe: Autodesk.Revit.DB.BuiltInFailures+AnalyticalModelFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 41
---

# AnalyticalModelFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AdjustCurveTooShort { get; }` | `AnalyticalModelFailures.AdjustCurveTooShort` | FailureDefinitionId |
| `FailureDefinitionId AdjustEdgeTooShort { get; }` | `AnalyticalModelFailures.AdjustEdgeTooShort` | FailureDefinitionId |
| `FailureDefinitionId AdjustEdgeTooShortErr { get; }` | `AnalyticalModelFailures.AdjustEdgeTooShortErr` | FailureDefinitionId |
| `FailureDefinitionId AdjustEdgeTooShortWarn { get; }` | `AnalyticalModelFailures.AdjustEdgeTooShortWarn` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalBeamSlabWarning { get; }` | `AnalyticalModelFailures.AnalyticalBeamSlabWarning` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalCurvedPanelNotValid { get; }` | `AnalyticalModelFailures.AnalyticalCurvedPanelNotValid` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalDiscrepancyWarning { get; }` | `AnalyticalModelFailures.AnalyticalDiscrepancyWarning` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalElementsInvalidAfterUpgrade { get; }` | `AnalyticalModelFailures.AnalyticalElementsInvalidAfterUpgrade` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalGapWarning { get; }` | `AnalyticalModelFailures.AnalyticalGapWarning` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalLinkJoinedNodes { get; }` | `AnalyticalModelFailures.AnalyticalLinkJoinedNodes` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalLinkNotConnected { get; }` | `AnalyticalModelFailures.AnalyticalLinkNotConnected` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalMemberInstability { get; }` | `AnalyticalModelFailures.AnalyticalMemberInstability` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalModelInstability { get; }` | `AnalyticalModelFailures.AnalyticalModelInstability` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalModelIsIncorrect { get; }` | `AnalyticalModelFailures.AnalyticalModelIsIncorrect` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalPanelNotPlanar { get; }` | `AnalyticalModelFailures.AnalyticalPanelNotPlanar` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalPanelNotVisible { get; }` | `AnalyticalModelFailures.AnalyticalPanelNotVisible` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalPhysicalCheckDone { get; }` | `AnalyticalModelFailures.AnalyticalPhysicalCheckDone` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalSupportCycleWarning { get; }` | `AnalyticalModelFailures.AnalyticalSupportCycleWarning` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalSurfaceCannotMove { get; }` | `AnalyticalModelFailures.AnalyticalSurfaceCannotMove` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalSurfaceCannotMoveByConnector { get; }` | `AnalyticalModelFailures.AnalyticalSurfaceCannotMoveByConnector` | FailureDefinitionId |
| `FailureDefinitionId AnalyticalTopBottomPlanesReversed { get; }` | `AnalyticalModelFailures.AnalyticalTopBottomPlanesReversed` | FailureDefinitionId |
| `FailureDefinitionId AutoDetectIgnoreLeaderWarning { get; }` | `AnalyticalModelFailures.AutoDetectIgnoreLeaderWarning` | FailureDefinitionId |
| `FailureDefinitionId BoundaryLinesIntersect { get; }` | `AnalyticalModelFailures.BoundaryLinesIntersect` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateAnalyticalGeometry { get; }` | `AnalyticalModelFailures.CannotCreateAnalyticalGeometry` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepAnalyticalAdjustment { get; }` | `AnalyticalModelFailures.CannotKeepAnalyticalAdjustment` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeAnalyticalGeometry { get; }` | `AnalyticalModelFailures.CannotMakeAnalyticalGeometry` | FailureDefinitionId |
| `FailureDefinitionId CannotSlantAnalyticalWallError { get; }` | `AnalyticalModelFailures.CannotSlantAnalyticalWallError` | FailureDefinitionId |
| `FailureDefinitionId ContextualAnalyticalModelModeNotEnabled { get; }` | `AnalyticalModelFailures.ContextualAnalyticalModelModeNotEnabled` | FailureDefinitionId |
| `FailureDefinitionId HighestAssociatedLevelBelowLowestAssociatedLevel { get; }` | `AnalyticalModelFailures.HighestAssociatedLevelBelowLowestAssociatedLevel` | FailureDefinitionId |
| `FailureDefinitionId LoadsMayBeNotUpToDate { get; }` | `AnalyticalModelFailures.LoadsMayBeNotUpToDate` | FailureDefinitionId |
| `FailureDefinitionId LowestAssociatedLevelAboveHighestAssociatedLevel { get; }` | `AnalyticalModelFailures.LowestAssociatedLevelAboveHighestAssociatedLevel` | FailureDefinitionId |
| `FailureDefinitionId ProjectionPlaneInvalidWall { get; }` | `AnalyticalModelFailures.ProjectionPlaneInvalidWall` | FailureDefinitionId |
| `FailureDefinitionId ProjectionPlanesNotIntersect { get; }` | `AnalyticalModelFailures.ProjectionPlanesNotIntersect` | FailureDefinitionId |
| `FailureDefinitionId ProjectionPlanesParallel { get; }` | `AnalyticalModelFailures.ProjectionPlanesParallel` | FailureDefinitionId |
| `FailureDefinitionId StructAnalyticalErrorProjection { get; }` | `AnalyticalModelFailures.StructAnalyticalErrorProjection` | FailureDefinitionId |
| `FailureDefinitionId StructuralElementMayNotBeSupported { get; }` | `AnalyticalModelFailures.StructuralElementMayNotBeSupported` | FailureDefinitionId |
| `FailureDefinitionId StructWallAnalyticalErrorAlign { get; }` | `AnalyticalModelFailures.StructWallAnalyticalErrorAlign` | FailureDefinitionId |
| `FailureDefinitionId StructWallAnalyticalErrorConversion { get; }` | `AnalyticalModelFailures.StructWallAnalyticalErrorConversion` | FailureDefinitionId |
| `FailureDefinitionId SupportCheckDone { get; }` | `AnalyticalModelFailures.SupportCheckDone` | FailureDefinitionId |
| `FailureDefinitionId UnableToUpgradeAnalyticalElementGeometry { get; }` | `AnalyticalModelFailures.UnableToUpgradeAnalyticalElementGeometry` | FailureDefinitionId |
| `FailureDefinitionId WallAMLostAdjustmentReference { get; }` | `AnalyticalModelFailures.WallAMLostAdjustmentReference` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```